tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1825_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1825_H_
#define _PIC16LF1825_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTC                         42
#define RC0                           43
#define RC1                           44
#define RC2                           45
#define RC3                           46
#define RC4                           47
#define RC5                           48
#define PIR1                          49
#define TMR1IF                        50
#define TMR2IF                        51
#define CCP1IF                        52
#define SSP1IF                        53
#define TXIF                          54
#define RCIF                          55
#define ADIF                          56
#define TMR1GIF                       57
#define PIR2                          58
#define CCP2IF                        59
#define BCL1IF                        60
#define EEIF                          61
#define C1IF                          62
#define C2IF                          63
#define OSFIF                         64
#define PIR3                          65
#define TMR4IF                        66
#define TMR6IF                        67
#define CCP3IF                        68
#define CCP4IF                        69
#define TMR0                          70
#define TMR1L                         71
#define TMR1H                         72
#define T1CON                         73
#define TMR1ON                        74
#define nT1SYNC                       75
#define T1OSCEN                       76
#define T1CKPS0                       77
#define T1CKPS                        78
#define T1CKPS1                       79
#define TMR1CS                        80
#define TMR1CS0                       81
#define TMR1CS1                       82
#define T1GCON                        83
#define T1GSS0                        84
#define T1GSS                         85
#define T1GSS1                        86
#define T1GVAL                        87
#define T1GGO                         88
#define T1GSPM                        89
#define T1GTM                         90
#define T1GPOL                        91
#define TMR1GE                        92
#define TMR2                          93
#define PR2                           94
#define T2CON                         95
#define T2CKPS0                       96
#define T2CKPS                        97
#define T2CKPS1                       98
#define TMR2ON                        99
#define T2OUTPS0                      100
#define T2OUTPS                       101
#define T2OUTPS1                      102
#define T2OUTPS2                      103
#define T2OUTPS3                      104
#define CPSCON0                       105
#define T0XCS                         106
#define CPSOUT                        107
#define CPSRNG                        108
#define CPSRNG0                       109
#define CPSRNG1                       110
#define CPSRM                         111
#define CPSON                         112
#define CPSCON1                       113
#define CPSCH                         114
#define CPSCH0                        115
#define CPSCH1                        116
#define CPSCH2                        117
#define CPSCH3                        118
#define TRISA                         119
#define TRISA0                        120
#define TRISA1                        121
#define TRISA2                        122
#define TRISA3                        123
#define TRISA4                        124
#define TRISA5                        125
#define TRISC                         126
#define TRISC0                        127
#define TRISC1                        128
#define TRISC2                        129
#define TRISC3                        130
#define TRISC4                        131
#define TRISC5                        132
#define PIE1                          133
#define TMR1IE                        134
#define TMR2IE                        135
#define CCP1IE                        136
#define SSP1IE                        137
#define TXIE                          138
#define RCIE                          139
#define ADIE                          140
#define TMR1GIE                       141
#define PIE2                          142
#define CCP2IE                        143
#define BCL1IE                        144
#define EEIE                          145
#define C1IE                          146
#define C2IE                          147
#define OSFIE                         148
#define PIE3                          149
#define TMR4IE                        150
#define TMR6IE                        151
#define CCP3IE                        152
#define CCP4IE                        153
#define OPTION_REG                    154
#define PS                            155
#define PS0                           156
#define PS1                           157
#define PS2                           158
#define PSA                           159
#define T0SE                          160
#define TMR0SE                        161
#define T0CS                          162
#define TMR0CS                        163
#define INTEDG                        164
#define nWPUEN                        165
#define PCON                          166
#define nBOR                          167
#define nPOR                          168
#define nRI                           169
#define nRMCLR                        170
#define STKUNF                        171
#define STKOVF                        172
#define WDTCON                        173
#define SWDTEN                        174
#define WDTPS                         175
#define WDTPS0                        176
#define WDTPS1                        177
#define WDTPS2                        178
#define WDTPS3                        179
#define WDTPS4                        180
#define OSCTUNE                       181
#define TUN0                          182
#define TUN                           183
#define TUN1                          184
#define TUN2                          185
#define TUN3                          186
#define TUN4                          187
#define TUN5                          188
#define OSCCON                        189
#define SCS0                          190
#define SCS                           191
#define SCS1                          192
#define IRCF                          193
#define IRCF0                         194
#define IRCF1                         195
#define IRCF2                         196
#define IRCF3                         197
#define SPLLEN                        198
#define OSCSTAT                       199
#define HFIOFS                        200
#define LFIOFR                        201
#define MFIOFR                        202
#define HFIOFL                        203
#define HFIOFR                        204
#define OSTS                          205
#define PLLR                          206
#define T1OSCR                        207
#define ADRESL                        208
#define ADRESH                        209
#define ADCON0                        210
#define ADON                          211
#define GO_nDONE                      212
#define GO                            213
#define ADGO                          214
#define CHS0                          215
#define CHS                           216
#define CHS1                          217
#define CHS2                          218
#define CHS3                          219
#define CHS4                          220
#define ADCON1                        221
#define ADPREF0                       222
#define ADPREF                        223
#define ADPREF1                       224
#define ADNREF                        225
#define ADCS0                         226
#define ADCS                          227
#define ADCS1                         228
#define ADCS2                         229
#define ADFM                          230
#define LATA                          231
#define LATA0                         232
#define LATA1                         233
#define LATA2                         234
#define LATA4                         235
#define LATA5                         236
#define LATC                          237
#define LATC0                         238
#define LATC1                         239
#define LATC2                         240
#define LATC3                         241
#define LATC4                         242
#define LATC5                         243
#define CM1CON0                       244
#define C1SYNC                        245
#define C1HYS                         246
#define C1SP                          247
#define C1POL                         248
#define C1OE                          249
#define C1OUT                         250
#define C1ON                          251
#define CM1CON1                       252
#define C1NCH0                        253
#define C1NCH                         254
#define C1NCH1                        255
#define C1PCH                         256
#define C1PCH0                        257
#define C1PCH1                        258
#define C1INTN                        259
#define C1INTP                        260
#define CM2CON0                       261
#define C2SYNC                        262
#define C2HYS                         263
#define C2SP                          264
#define C2POL                         265
#define C2OE                          266
#define C2OUT                         267
#define C2ON                          268
#define CM2CON1                       269
#define C2NCH0                        270
#define C2NCH                         271
#define C2NCH1                        272
#define C2PCH                         273
#define C2PCH0                        274
#define C2PCH1                        275
#define C2INTN                        276
#define C2INTP                        277
#define CMOUT                         278
#define MC1OUT                        279
#define MC2OUT                        280
#define BORCON                        281
#define BORRDY                        282
#define SBOREN                        283
#define FVRCON                        284
#define ADFVR0                        285
#define ADFVR                         286
#define ADFVR1                        287
#define CDAFVR0                       288
#define CDAFVR                        289
#define CDAFVR1                       290
#define TSRNG                         291
#define TSEN                          292
#define FVRRDY                        293
#define FVREN                         294
#define DACCON0                       295
#define DACNSS                        296
#define DACPSS                        297
#define DACPSS0                       298
#define DACPSS1                       299
#define DACOE                         300
#define DACLPS                        301
#define DACEN                         302
#define DACCON1                       303
#define DACR0                         304
#define DACR                          305
#define DACR1                         306
#define DACR2                         307
#define DACR3                         308
#define DACR4                         309
#define SRCON0                        310
#define SRPR                          311
#define SRPS                          312
#define SRNQEN                        313
#define SRQEN                         314
#define SRCLK0                        315
#define SRCLK                         316
#define SRCLK1                        317
#define SRCLK2                        318
#define SRLEN                         319
#define SRCON1                        320
#define SRRC1E                        321
#define SRRCKE                        322
#define SRRPE                         323
#define SRSC1E                        324
#define SRSCKE                        325
#define SRSPE                         326
#define APFCON0                       327
#define TXCKSEL                       328
#define T1GSEL                        329
#define SSSEL                         330
#define SDOSEL                        331
#define RXDTSEL                       332
#define APFCON1                       333
#define CCP2SEL                       334
#define P2BSEL                        335
#define P1CSEL                        336
#define P1DSEL                        337
#define ANSA0                         338
#define ANSELA                        339
#define ANSA1                         340
#define ANSA2                         341
#define ANSA4                         342
#define ANSC0                         343
#define ANSELC                        344
#define ANSC1                         345
#define ANSC2                         346
#define ANSC3                         347
#define EEADRL                        348
#define EEADRH                        349
#define EEDATL                        350
#define EEDATH                        351
#define EECON1                        352
#define RD                            353
#define WR                            354
#define WREN                          355
#define WRERR                         356
#define FREE                          357
#define LWLO                          358
#define CFGS                          359
#define EEPGD                         360
#define EECON2                        361
#define RCREG                         362
#define TXREG                         363
#define SPBRGL                        364
#define SPBRGH                        365
#define RCSTA                         366
#define RX9D                          367
#define OERR                          368
#define FERR                          369
#define ADDEN                         370
#define CREN                          371
#define SREN                          372
#define RX9                           373
#define SPEN                          374
#define TXSTA                         375
#define TX9D                          376
#define TRMT                          377
#define BRGH                          378
#define SENDB                         379
#define SYNC                          380
#define TXEN                          381
#define TX9                           382
#define CSRC                          383
#define BAUDCON                       384
#define ABDEN                         385
#define WUE                           386
#define BRG16                         387
#define SCKP                          388
#define RCIDL                         389
#define ABDOVF                        390
#define WPUA0                         391
#define WPUA                          392
#define WPUA1                         393
#define WPUA2                         394
#define WPUA3                         395
#define WPUA4                         396
#define WPUA5                         397
#define WPUC                          398
#define WPUC0                         399
#define WPUC1                         400
#define WPUC2                         401
#define WPUC3                         402
#define WPUC4                         403
#define WPUC5                         404
#define SSP1BUF                       405
#define SSPBUF                        406
#define SSP1ADD                       407
#define SSPADD                        408
#define SSP1MSK                       409
#define SSPMSK                        410
#define SSP1STAT                      411
#define BF                            412
#define UA                            413
#define R_nW                          414
#define S                             415
#define P                             416
#define D_nA                          417
#define CKE                           418
#define SMP                           419
#define SSP1CON1                      420
#define SSPM0                         421
#define SSPM                          422
#define SSPM1                         423
#define SSPM2                         424
#define SSPM3                         425
#define CKP                           426
#define SSPEN                         427
#define SSPOV                         428
#define WCOL                          429
#define SSP1CON2                      430
#define SEN                           431
#define RSEN                          432
#define PEN                           433
#define RCEN                          434
#define ACKEN                         435
#define ACKDT                         436
#define ACKSTAT                       437
#define GCEN                          438
#define SSP1CON3                      439
#define DHEN                          440
#define AHEN                          441
#define SBCDE                         442
#define SDAHT                         443
#define BOEN                          444
#define SCIE                          445
#define PCIE                          446
#define ACKTIM                        447
#define CCPR1L                        448
#define CCPR1H                        449
#define CCP1CON                       450
#define CCP1M0                        451
#define CCP1M                         452
#define CCP1M1                        453
#define CCP1M2                        454
#define CCP1M3                        455
#define DC1B                          456
#define DC1B0                         457
#define DC1B1                         458
#define P1M                           459
#define P1M0                          460
#define P1M1                          461
#define PWM1CON                       462
#define P1DC                          463
#define P1DC0                         464
#define P1DC1                         465
#define P1DC2                         466
#define P1DC3                         467
#define P1DC4                         468
#define P1DC5                         469
#define P1DC6                         470
#define P1RSEN                        471
#define PSS1BD                        472
#define PSS1BD0                       473
#define PSS1BD1                       474
#define PSS1AC                        475
#define PSS1AC0                       476
#define PSS1AC1                       477
#define CCP1AS                        478
#define CCP1AS0                       479
#define CCP1AS1                       480
#define CCP1AS2                       481
#define CCP1ASE                       482
#define PSTR1CON                      483
#define STR1A                         484
#define STR1B                         485
#define STR1C                         486
#define STR1D                         487
#define STR1SYNC                      488
#define CCPR2L                        489
#define CCPR2H                        490
#define CCP2CON                       491
#define CCP2M                         492
#define CCP2M0                        493
#define CCP2M1                        494
#define CCP2M2                        495
#define CCP2M3                        496
#define DC2B                          497
#define DC2B0                         498
#define DC2B1                         499
#define P2M                           500
#define P2M0                          501
#define P2M1                          502
#define PWM2CON                       503
#define P2DC                          504
#define P2DC0                         505
#define P2DC1                         506
#define P2DC2                         507
#define P2DC3                         508
#define P2DC4                         509
#define P2DC5                         510
#define P2DC6                         511
#define P2RSEN                        512
#define PSS2BD                        513
#define PSS2BD0                       514
#define PSS2BD1                       515
#define PSS2AC0                       516
#define PSS2AC                        517
#define PSS2AC1                       518
#define CCP2AS0                       519
#define CCP2AS                        520
#define CCP2AS1                       521
